MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2025DAB176/mcu.h
extern volatile __DMTPRECLRbits_t DMTPRECLRbits __asm__ ("DMTPRECLR") __attribute__((section("sfrs"), address(0xBF800A10)));
#define DMTCLR DMTCLR
extern volatile uint32_t   DMTCLR __attribute__((section("sfrs"), address(0xBF800A20)));
typedef struct {
  uint32_t STEP2:8;
} __DMTCLRbits_t;
extern volatile __DMTCLRbits_t DMTCLRbits __asm__ ("DMTCLR") __attribute__((section("sfrs"), address(0xBF800A20)));
#define DMTSTAT DMTSTAT
extern volatile uint32_t   DMTSTAT __attribute__((section("sfrs"), address(0xBF800A30)));
typedef union {
  struct {
    uint32_t WINOPN:1;
    uint32_t :4;
    uint32_t DMTEVENT:1;
    uint32_t BAD:2;
  };
  struct {
    uint32_t :6;
    uint32_t BAD2:1;
    uint32_t BAD1:1;
  };
  struct {
    uint32_t w:32;
  };
} __DMTSTATbits_t;
extern volatile __DMTSTATbits_t DMTSTATbits __asm__ ("DMTSTAT") __attribute__((section("sfrs"), address(0xBF800A30)));
#define DMTCNT DMTCNT
extern volatile uint32_t   DMTCNT __attribute__((section("sfrs"), address(0xBF800A40)));
typedef struct {
  uint32_t COUNTER:32;
} __DMTCNTbits_t;
extern volatile __DMTCNTbits_t DMTCNTbits __asm__ ("DMTCNT") __attribute__((section("sfrs"), address(0xBF800A40)));
#define DMTPSCNT DMTPSCNT
extern volatile uint32_t   DMTPSCNT __attribute__((section("sfrs"), address(0xBF800A60)));
typedef struct {
  uint32_t PSCNT:32;
} __DMTPSCNTbits_t;
extern volatile __DMTPSCNTbits_t DMTPSCNTbits __asm__ ("DMTPSCNT") __attribute__((section("sfrs"), address(0xBF800A60)));
#define DMTPSINTV DMTPSINTV
extern volatile uint32_t   DMTPSINTV __attribute__((section("sfrs"), address(0xBF800A70)));
typedef struct {
  uint32_t PSINTV:32;
} __DMTPSINTVbits_t;
extern volatile __DMTPSINTVbits_t DMTPSINTVbits __asm__ ("DMTPSINTV") __attribute__((section("sfrs"), address(0xBF800A70)));
#define CVRCON CVRCON
extern volatile uint32_t   CVRCON __attribute__((section("sfrs"), address(0xBF800E00)));
typedef union {
  struct {
    uint32_t CVR:4;
    uint32_t CVRSS:1;
    uint32_t CVRR:1;
    uint32_t CVROE:1;
    uint32_t :8;
    uint32_t ON:1;
  };
  struct {
    uint32_t CVR0:1;
    uint32_t CVR1:1;
    uint32_t CVR2:1;
    uint32_t CVR3:1;
  };
  struct {
    uint32_t w:32;
  };
} __CVRCONbits_t;
extern volatile __CVRCONbits_t CVRCONbits __asm__ ("CVRCON") __attribute__((section("sfrs"), address(0xBF800E00)));
extern volatile uint32_t        CVRCONCLR __attribute__((section("sfrs"),address(0xBF800E04)));
extern volatile uint32_t        CVRCONSET __attribute__((section("sfrs"),address(0xBF800E08)));
extern volatile uint32_t        CVRCONINV __attribute__((section("sfrs"),address(0xBF800E0C)));
#define _ICDCON _ICDCON
extern volatile uint32_t   _ICDCON __attribute__((section("sfrs"), address(0xBF801130)));
typedef struct {
  uint32_t CKSWBKEN:1;
  uint32_t SLPBKEN:1;
  uint32_t WDTBKEN:1;
  uint32_t WDTEN:1;
  uint32_t RSTBUG:1;
  uint32_t DMTBKEN:1;
  uint32_t DMTEN:1;
  uint32_t :7;
  uint32_t FRZ:1;
} ___ICDCONbits_t;
extern volatile ___ICDCONbits_t _ICDCONbits __asm__ ("_ICDCON") __attribute__((section("sfrs"), address(0xBF801130)));
#define _ICDSTAT _ICDSTAT
extern volatile uint32_t   _ICDSTAT __attribute__((section("sfrs"), address(0xBF801140)));
typedef struct {
  uint32_t CKSWBF:1;
  uint32_t SLPBF:1;
  uint32_t WDTBF:1;
  uint32_t DMTBF:1;
  uint32_t WDTRUNBF:1;
  uint32_t WDTSLPBF:1;
} ___ICDSTATbits_t;
extern volatile ___ICDSTATbits_t _ICDSTATbits __asm__ ("_ICDSTAT") __attribute__((section("sfrs"), address(0xBF801140)));
#define OSCCON OSCCON
extern volatile uint32_t   OSCCON __attribute__((section("sfrs"), address(0xBF801200)));
typedef struct {
  uint32_t OSWEN:1;
  uint32_t SOSCEN:1;
  uint32_t :1;
  uint32_t CF:1;
  uint32_t SLPEN:1;
  uint32_t :2;
  uint32_t CLKLOCK:1;
  uint32_t NOSC:3;
  uint32_t :1;
  uint32_t COSC:3;
  uint32_t :6;
  uint32_t SLP2SPD:1;
  uint32_t :1;
  uint32_t DRMEN:1;
  uint32_t FRCDIV:3;
} __OSCCONbits_t;
extern volatile __OSCCONbits_t OSCCONbits __asm__ ("OSCCON") __attribute__((section("sfrs"), address(0xBF801200)));
extern volatile uint32_t        OSCCONCLR __attribute__((section("sfrs"),address(0xBF801204)));
extern volatile uint32_t        OSCCONSET __attribute__((section("sfrs"),address(0xBF801208)));
extern volatile uint32_t        OSCCONINV __attribute__((section("sfrs"),address(0xBF80120C)));
#define OSCTUN OSCTUN
extern volatile uint32_t   OSCTUN __attribute__((section("sfrs"), address(0xBF801210)));
typedef struct {
  uint32_t TUN:6;
} __OSCTUNbits_t;
extern volatile __OSCTUNbits_t OSCTUNbits __asm__ ("OSCTUN") __attribute__((section("sfrs"), address(0xBF801210)));
extern volatile uint32_t        OSCTUNCLR __attribute__((section("sfrs"),address(0xBF801214)));
extern volatile uint32_t        OSCTUNSET __attribute__((section("sfrs"),address(0xBF801218)));
extern volatile uint32_t        OSCTUNINV __attribute__((section("sfrs"),address(0xBF80121C)));
#define SPLLCON SPLLCON
extern volatile uint32_t   SPLLCON __attribute__((section("sfrs"), address(0xBF801220)));
typedef struct {
  uint32_t PLLRANGE:3;
  uint32_t :4;
  uint32_t PLLICLK:1;
  uint32_t PLLIDIV:3;
  uint32_t :5;
  uint32_t PLLMULT:7;
  uint32_t :1;
  uint32_t PLLODIV:3;
} __SPLLCONbits_t;
extern volatile __SPLLCONbits_t SPLLCONbits __asm__ ("SPLLCON") __attribute__((section("sfrs"), address(0xBF801220)));
extern volatile uint32_t        SPLLCONCLR __attribute__((section("sfrs"),address(0xBF801224)));
extern volatile uint32_t        SPLLCONSET __attribute__((section("sfrs"),address(0xBF801228)));
extern volatile uint32_t        SPLLCONINV __attribute__((section("sfrs"),address(0xBF80122C)));
#define RCON RCON
extern volatile uint32_t   RCON __attribute__((section("sfrs"), address(0xBF801240)));
typedef union {
  struct {
    uint32_t POR:1;
    uint32_t BOR:1;
    uint32_t IDLE:1;
    uint32_t SLEEP:1;
    uint32_t WDTO:1;
    uint32_t DMTO:1;
    uint32_t SWR:1;
    uint32_t EXTR:1;
    uint32_t :1;
    uint32_t CMR:1;
    uint32_t DPSLP:1;
    uint32_t :5;
    uint32_t VBAT:1;
    uint32_t VBPOR:1;
    uint32_t :8;
    uint32_t BCFGFAIL:1;
    uint32_t BCFGERR:1;
    uint32_t :1;
    uint32_t HVDCORE:1;
  };
  struct {
    uint32_t :29;
    uint32_t HVD1V8R:1;
  };
} __RCONbits_t;
extern volatile __RCONbits_t RCONbits __asm__ ("RCON") __attribute__((section("sfrs"), address(0xBF801240)));
extern volatile uint32_t        RCONCLR __attribute__((section("sfrs"),address(0xBF801244)));
extern volatile uint32_t        RCONSET __attribute__((section("sfrs"),address(0xBF801248)));
extern volatile uint32_t        RCONINV __attribute__((section("sfrs"),address(0xBF80124C)));
#define RSWRST RSWRST
extern volatile uint32_t   RSWRST __attribute__((section("sfrs"), address(0xBF801250)));
typedef struct {
  uint32_t SWRST:1;
} __RSWRSTbits_t;
extern volatile __RSWRSTbits_t RSWRSTbits __asm__ ("RSWRST") __attribute__((section("sfrs"), address(0xBF801250)));
extern volatile uint32_t        RSWRSTCLR __attribute__((section("sfrs"),address(0xBF801254)));
extern volatile uint32_t        RSWRSTSET __attribute__((section("sfrs"),address(0xBF801258)));
extern volatile uint32_t        RSWRSTINV __attribute__((section("sfrs"),address(0xBF80125C)));
#define RNMICON RNMICON
extern volatile uint32_t   RNMICON __attribute__((section("sfrs"), address(0xBF801260)));
typedef union {
  struct {
    uint32_t NMICNT:16;
    uint32_t WDTS:1;
    uint32_t CF:1;
    uint32_t LVD:1;
    uint32_t GNMI:1;
    uint32_t :3;
    uint32_t SWNMI:1;
    uint32_t WDTO:1;
    uint32_t DMTO:1;
  };
  struct {
    uint32_t :24;
    uint32_t WDTR:1;
  };
} __RNMICONbits_t;
extern volatile __RNMICONbits_t RNMICONbits __asm__ ("RNMICON") __attribute__((section("sfrs"), address(0xBF801260)));
extern volatile uint32_t        RNMICONCLR __attribute__((section("sfrs"),address(0xBF801264)));
extern volatile uint32_t        RNMICONSET __attribute__((section("sfrs"),address(0xBF801268)));
extern volatile uint32_t        RNMICONINV __attribute__((section("sfrs"),address(0xBF80126C)));
#define PWRCON PWRCON
extern volatile uint32_t   PWRCON __attribute__((section("sfrs"), address(0xBF801270)));
typedef struct {
  uint32_t VREGS:1;
} __PWRCONbits_t;
